rhoCentralFoam/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $temperature;

boundaryField
{
    wallPatch
    {
        type            zeroGradient;
    }

    inletPatch
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    outletPatch
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    farFieldPatch
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    symmetryPatch
    {
        type            symmetry; // symmetryPlane might cause problems if the surface is not perfectly flat 
    }
}

// ************************************************************************* //
