rhoCentralFoam/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    wallPatch
    {
        type            noSlip;
    }

    inletPatch
    {
        type            freestreamVelocity;
        freestreamValue $internalField;
    }

    outletPatch
    {
        type            freestreamVelocity;
        freestreamValue $internalField;
    }

    farFieldPatch
    {
        type            freestreamVelocity;
        freestreamValue $internalField;
    }

    symmetryPatch
    {
        type            symmetry; // symmetryPlane might cause problems if the surface is not perfectly flat 
    }
}

// ************************************************************************* //
