rhoCentralFoam/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    wallPatch
    {
        type            zeroGradient;
    }

    inletPatch
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }

    outletPatch
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }

    farFieldPatch
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }

    symmetryPatch
    {
        type            symmetry; // symmetryPlane might cause problems if the surface is not perfectly flat 
    }
}

// ************************************************************************* //
